{
  "data": [
    {
      "title": "Flutter Dev Ssr Adv. - Industria Bancaria",
      "company": "Globant",
      "description": "Desarrollo y soporte de aplicación de banca ecuatoriana para la sección de empresas",
      "isCurrent": true,
      "initDate": "2025-02-01",
      "endDate": "2025-11-01",
      "skills": [
        { "title": "Android Studio" },
        { "title": "Xcode" },
        { "title": "Azure Pipeline" },
        { "title": "Microsoft Suite" },
        { "title": "GO Router" },
        { "title": "Packages" }
      ],
      "activities": [
        { "body": "Liderar el equipo de la aplicación y apoyar el flujo de trabajo empresarial del Líder Técnico." },
        { "body": "Participar en las sesiones de planificación con los equipos de desarrollo, producto y diseño, estimando historias de usuario para el equipo Flutter." },
        { "body": "Desarrollar nuevas funcionalidades y corrección de errores." },
        { "body": "Realizar mantenimiento de paquetes internos con pruebas y documentación." },
        { "body": "Analizar y planificar mejoras técnicas para mejorar el rendimiento de la aplicación." },
        { "body": "Apoyar los últimos sprints de pruebas (desarrollo, control de calidad y producción)." },
        { "body": "Corregir errores de los pipelines de iOS y Android en Azure Pipelines." }
      ]
    },
    {
      "title": "Flutter Dev Ssr Adv. - Líder de equipo - Empresa de Salud - Latam",
      "company": "Globant",
      "description": "Liderazgo técnico del equipo de desarrollo, supervisando la implementación de soluciones para una importante compañía de salud en Latam.",
      "isCurrent": false,
      "initDate": "2024-01-01",
      "endDate": "2025-01-01",
      "skills": [
        { "title": "Android Studio" },
        { "title": "CLA Documentation" },
        { "title": "Firebase Deprecation Alternatives" },
        { "title": "Xcode" }
      ],
      "activities": [
        { "body": "Liderar las reuniones diarias del equipo y delegar responsabilidades según el cronograma establecido con el cliente." },
        { "body": "Mantener una comunicación constante y eficaz con el cliente para comprender los requisitos urgentes, ayudando con la gestión eficiente del tiempo para el equipo." },
        { "body": "Completar la documentación necesaria requerida por el cliente para el lanzamiento de algunos productos." },
        { "body": "Conocer las alertas del sistema para prevenir problemas o errores." },
        { "body": "Gestionar el proceso de lanzamiento en entornos de producción." },
        { "body": "Incorporar nuevas funciones de plataformas antiguas desarrolladas con otras tecnologías (Angular, Ionic)." },
        { "body": "Colaborar con la carga de contenido que la página web muestra en distintos países." },
        { "body": "Gestionar el proceso de traducción del conocimiento (KT) con el equipo de desarrollo hacia el equipo del cliente." }
      ]
    },
    {
      "title": "Flutter Dev Ssr - Empresa de Salud - Latam",
      "company": "Globant",
      "description": "Soporte y optimización de desarrollos de la aplicación para personal médico de una importante compañía de salud en Latam.",
      "isCurrent": false,
      "initDate": "2022-12-01",
      "endDate": "2024-12-01",
      "skills": [
        { "title": "MVVM" },
        { "title": "Provider" },
        { "title": "Local Auth" },
        { "title": "Freezed" }
      ],
      "activities": [
        { "body": "Resolución de incidencias de la aplicación Nutritional Connection." },
        { "body": "Desarrollar nuevas funcionalidades aprobadas por el responsable del proyecto y la agencia de marketing." },
        { "body": "Validar checklist previa al lanzamiento para garantizar la estabilidad del despliegue (pipelines y escáner de seguridad)." },
        { "body": "Liderar el proceso de testing (TestFlight - Android Closed beta testing) con personal aprobado por el cliente." }
      ]
    },
    {
      "title": "Flutter Dev Ssr - Industria de Transporte - USA",
      "company": "Globant",
      "description": "Desarrollo de aplicación MVP para empresa de transporte en EE. UU.",
      "isCurrent": false,
      "initDate": "2022-01-01",
      "endDate": "2022-11-01",
      "skills": [
        { "title": "Flutter BLOC" },
        { "title": "Clean Architecture" },
        { "title": "GET IT" },
        { "title": "Unit Testing" },
        { "title": "AutoRoute" }
      ],
      "activities": [
        { "body": "Desarrollar una aplicación que funciona como plataforma central para conectar conductores de camiones con oportunidades laborales." },
        { "body": "Desarrollar interfaz de deslizamiento similar a Tinder para una gestión de las ofertas de trabajo, permitiendo aplicar o rechazar rápidamente estas oportunidades." },
        { "body": "Añadir la funcionalidad de geolocalización para priorizar ofertas por ubicación." }
      ]
    },
    {
      "title": "Mobile Developer Leader",
      "company": "Loro (Wishper SAS)",
      "description": "Liderazgo, desarrollo y mantenimiento de aplicación ecommerce para centros comerciales bajo el modelo de red social.",
      "isCurrent": false,
      "initDate": "2020-02-01",
      "endDate": "2022-11-01",
      "skills": [
        { "title": "Flutter BLOC" },
        { "title": "Null Safety Migration" },
        { "title": "Xcode" },
        { "title": "FastLane" },
        { "title": "Versioning" }
      ],
      "activities": [
        { "body": "Diseñar y ejecutar planes de optimización por tipo de dispositivo para mejorar la experiencia del usuario." },
        { "body": "Diseñar y desarrollar un asistente mascota persistente en la aplicación con información relevante, curiosidades y chistes que mejoró la retención en un 40%." },
        { "body": "Modificar la sección de checkout para habilitar e integrar distintos métodos de pago adicionales a TC." },
        { "body": "Desarrollar secciones de Retos que permitían a los usuarios y marcas interactuar juntos bajo la modalidad de videos." },
        { "body": "Integrar un ambiente con dos plataformas de pago para evitar el porcentaje de rechazo en las compras." },
        { "body": "Participar en la nueva estructuración de datos de Loro, que permitió la integración de cualquier tipo de marca." },
        { "body": "Desarrollar nueva sección de restaurantes con relación de geolocalización para visualizar restaurantes cercanos." },
        { "body": "Integrar dynamic links con información de productos, categorías y usuarios para una correcta redirección." },
        { "body": "Participar en los comités de dirección y alineación del equipo técnico, marketing y gerencia." }
      ]
    },
    {
      "title": "Mobile Developer",
      "company": "Loro (Wishper SAS)",
      "description": "Desarrollo y mantenimiento de aplicación ecommerce para centros comerciales bajo el modelo de red social.",
      "isCurrent": false,
      "initDate": "2020-02-01",
      "endDate": "2019-05-01",
      "skills": [
        { "title": "Flutter BLOC" },
        { "title": "Android Studio" },
        { "title": "Dart" }
      ],
      "activities": [
        { "body": "Desarrollar el MVP de la red social para comprar/regalar a contactos." },
        { "body": "Desplegar el MVP para AppStore y Google Play Store." },
        { "body": "Integrar Google Analytics para obtención de reportes para el equipo de marketing." }
      ]
    },
    {
      "title": "Android Developer",
      "company": "Azzorti Colombia",
      "description": "Mantenimiento de una aplicación nativa en Android con Java con actualización mensual de documentos de uso laboral de los/las clientes.",
      "isCurrent": false,
      "initDate": "2018-05-01",
      "endDate": "2018-08-01",
      "skills": [
        { "title": "Java" },
        { "title": "Android Studio" },
        { "title": "Generate Pdf" }
      ],
      "activities": [
        { "body": "Actualización mensual de catálogo de ventas para el posterior descargue por parte de las clientas." },
        { "body": "Generación de APK con diseño/nombres personalizados para distintos países como Colombia, Bolivia y Perú." }
      ]
    },
    {
      "title": "Practicante RAN (Radio Acceso Nacional)",
      "company": "Avantel SAS",
      "description": "Prácticas de ingeniería enfocadas en el desarrollo de herramientas internas con Python (PYQT) y Java para la automatización de informes técnicos.",
      "isCurrent": false,
      "initDate": "2017-06-01",
      "endDate": "2018-02-01",
      "skills": [
        { "title": "Python" },
        { "title": "PYQT" },
        { "title": "Java" },
        { "title": "Android Studio" },
        { "title": "Reports" },
        { "title": "UI" }
      ],
      "activities": [
        { "body": "Mantenimiento y creación de plugins para Google Earth utilizando Python, para el acceso y visualización de información de la red nacional." },
        { "body": "Desarrollo de aplicación Android para automatización de pruebas y toma/envío de reportes para smartphones del equipo técnico." },
        { "body": "Implementación de aplicación Android para llenar reporte diario de los vehículos del equipo técnico antes de salir a campo." }
      ]
    }
  ]
}